tap "apenngrace/vulkan"
tap "gromgit/new-life"
tap "homebrew/command-not-found"
tap "openrr/tap"
brew "libtiff"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "openssl@3"
brew "asio"
brew "assimp"
brew "libssh2"
brew "libgit2"
brew "bat"
brew "blueutil"
brew "btop"
brew "freetype"
brew "glib"
brew "eigen"
brew "gcc", link: false
brew "metis"
brew "openblas"
brew "pycparser"
brew "cffi"
brew "pkgconf"
brew "cloudflared"
brew "cmake"
brew "cpufetch"
brew "croc"
brew "cryptography"
brew "entr"
brew "openssl@1.1"
brew "exa"
brew "exiftool"
brew "eza"
brew "fd"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "openjpeg"
brew "leptonica"
brew "libass"
brew "srt"
brew "tesseract"
brew "zeromq"
brew "ffmpeg"
brew "fzf"
brew "gemini-cli"
brew "gh"
brew "ghostscript"
brew "glfw"
brew "libusb"
brew "graphviz"
brew "htop"
brew "libheif"
brew "libraw"
brew "libzip"
brew "imagemagick"
brew "iproute2mac"
brew "jq"
brew "latexindent"
brew "lima"
brew "log4cxx"
brew "mosh"
brew "mprocs"
brew "neofetch"
brew "neovim"
brew "netcat"
brew "ninja"
brew "nmap"
brew "nvm"
brew "opencv"
brew "p7zip"
brew "pcre"
brew "poco"
brew "poppler"
brew "pre-commit"
brew "unicorn"
brew "pwntools"
brew "python@3.12"
brew "python-tk@3.12"
brew "python@3.10"
brew "python@3.11"
brew "qemu"
brew "qpdf"
brew "qt"
brew "ripgrep"
brew "rsync"
brew "sherlock"
brew "sshuttle"
brew "television"
brew "tinyxml2"
brew "tldr"
brew "tmux"
brew "tree"
brew "uv"
brew "wget"
brew "yarn"
brew "youtube-dl"
brew "yt-dlp"
brew "zoxide"
brew "gromgit/new-life/unrar"
brew "openrr/tap/urdf-viz"
cask "db-browser-for-sqlite"
cask "distroav"
cask "font-0xproto-nerd-font"
cask "font-3270-nerd-font"
cask "font-agave-nerd-font"
cask "font-anonymice-nerd-font"
cask "font-arimo-nerd-font"
cask "font-aurulent-sans-mono-nerd-font"
cask "font-bigblue-terminal-nerd-font"
cask "font-bitstream-vera-sans-mono-nerd-font"
cask "font-blex-mono-nerd-font"
cask "font-caskaydia-cove-nerd-font"
cask "font-caskaydia-mono-nerd-font"
cask "font-code-new-roman-nerd-font"
cask "font-comic-shanns-mono-nerd-font"
cask "font-commit-mono-nerd-font"
cask "font-cousine-nerd-font"
cask "font-d2coding-nerd-font"
cask "font-daddy-time-mono-nerd-font"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-droid-sans-mono-nerd-font"
cask "font-envy-code-r-nerd-font"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-geist-mono-nerd-font"
cask "font-go-mono-nerd-font"
cask "font-gohufont-nerd-font"
cask "font-hack-nerd-font"
cask "font-hasklug-nerd-font"
cask "font-heavy-data-nerd-font"
cask "font-hurmit-nerd-font"
cask "font-im-writing-nerd-font"
cask "font-inconsolata-go-nerd-font"
cask "font-inconsolata-lgc-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-intone-mono-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-iosevka-term-nerd-font"
cask "font-iosevka-term-slab-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-lekton-nerd-font"
cask "font-liberation-nerd-font"
cask "font-lilex-nerd-font"
cask "font-m+-nerd-font"
cask "font-martian-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-monaspice-nerd-font"
cask "font-monocraft-nerd-font"
cask "font-monofur-nerd-font"
cask "font-monoid-nerd-font"
cask "font-mononoki-nerd-font"
cask "font-noto-nerd-font"
cask "font-opendyslexic-nerd-font"
cask "font-overpass-nerd-font"
cask "font-profont-nerd-font"
cask "font-proggy-clean-tt-nerd-font"
cask "font-recursive-mono-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-shure-tech-mono-nerd-font"
cask "font-space-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "font-terminess-ttf-nerd-font"
cask "font-tinos-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "font-ubuntu-nerd-font"
cask "font-ubuntu-sans-nerd-font"
cask "font-victor-mono-nerd-font"
cask "font-zed-mono-nerd-font"
cask "libndi"
cask "macfuse"
cask "monitorcontrol"
cask "qlmarkdown"
cask "quicklook-video"
cask "syntax-highlight"
cask "xquartz"
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "alefragnani.project-manager"
vscode "alexcvzz.vscode-sqlite"
vscode "alexpasmantier.television"
vscode "analytic-signal.preview-mp4"
vscode "anthropic.claude-code"
vscode "antyos.openscad"
vscode "aster.vscode-subtitles"
vscode "asvetliakov.vscode-neovim"
vscode "batisteo.vscode-django"
vscode "bbenoist.nix"
vscode "bmewburn.vscode-intelephense-client"
vscode "chadalen.vscode-jetbrains-icon-theme"
vscode "christian-kohler.path-intellisense"
vscode "cschlosser.doxdocgen"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dotjoshjohnson.xml"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "ex-codes.pine-script-syntax-highlighter"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-complete-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "gimly81.matlab"
vscode "github.copilot-labs"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "google.geminicodeassist"
vscode "gruntfuggly.todo-tree"
vscode "ibm.output-colorizer"
vscode "icrawl.discord-vscode"
vscode "isaact.verilog-formatter"
vscode "james-yu.latex-workshop"
vscode "jan-dolejsi.pddl"
vscode "janisdd.vscode-edit-csv"
vscode "jbockle.jbockle-format-files"
vscode "jeff-hykin.better-cpp-syntax"
vscode "jock.svg"
vscode "johnpapa.vscode-peacock"
vscode "josetr.cmake-language-support-vscode"
vscode "juanblanco.solidity"
vscode "kelvin.vscode-sshfs"
vscode "kevinrose.vsc-python-indent"
vscode "lacroixdavid1.vscode-format-context-menu"
vscode "lochbrunner.vscode-hdf5-viewer"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mongodb.mongodb-vscode"
vscode "morningfrog.urdf-visualizer"
vscode "moyu.snapcode"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-zh-hant"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-serial-monitor"
vscode "ms-vsliveshare.vsliveshare"
vscode "mshr-h.veriloghdl"
vscode "natizyskunk.sftp"
vscode "naumovs.color-highlight"
vscode "njpwerner.autodocstring"
vscode "openai.chatgpt"
vscode "percy.vscode-pydata-viewer"
vscode "peterschmalfeldt.explorer-exclude"
vscode "pkief.material-icon-theme"
vscode "pnp.polacode"
vscode "ptd.vscode-unitymeta"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "sdras.night-owl"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shyykoserhiy.vscode-spotify"
vscode "simonsiefke.svg-preview"
vscode "sissel.shopify-liquid"
vscode "smilerobotics.urdf"
vscode "streetsidesoftware.code-spell-checker"
vscode "tabnine.tabnine-vscode"
vscode "teros-technology.teroshdl"
vscode "timonwong.shellcheck"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "wallabyjs.console-ninja"
vscode "wayou.vscode-todo-highlight"
vscode "wholroyd.jinja"
vscode "xdebug.php-debug"
vscode "xdebug.php-pack"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
vscode "zobo.php-intellisense"
