aaron-bond.better-comments
adpyke.codesnap
alefragnani.project-manager
alexcvzz.vscode-sqlite
alexpasmantier.television
analytic-signal.preview-mp4
anthropic.claude-code
antyos.openscad
aster.vscode-subtitles
asvetliakov.vscode-neovim
batisteo.vscode-django
bbenoist.nix
bmewburn.vscode-intelephense-client
chadalen.vscode-jetbrains-icon-theme
christian-kohler.path-intellisense
cschlosser.doxdocgen
dart-code.dart-code
dart-code.flutter
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
docker.docker
donjayamanne.python-environment-manager
donjayamanne.python-extension-pack
dotjoshjohnson.xml
dsznajder.es7-react-js-snippets
eamodio.gitlens
ecmel.vscode-html-css
esbenp.prettier-vscode
ex-codes.pine-script-syntax-highlighter
formulahendry.auto-close-tag
formulahendry.auto-complete-tag
formulahendry.auto-rename-tag
formulahendry.code-runner
foxundermoon.shell-format
gimly81.matlab
github.copilot-labs
github.remotehub
github.vscode-github-actions
github.vscode-pull-request-github
golang.go
google.geminicodeassist
gruntfuggly.todo-tree
ibm.output-colorizer
icrawl.discord-vscode
isaact.verilog-formatter
james-yu.latex-workshop
jan-dolejsi.pddl
janisdd.vscode-edit-csv
jbockle.jbockle-format-files
jeff-hykin.better-cpp-syntax
jock.svg
johnpapa.vscode-peacock
josetr.cmake-language-support-vscode
juanblanco.solidity
kelvin.vscode-sshfs
kevinrose.vsc-python-indent
lacroixdavid1.vscode-format-context-menu
lochbrunner.vscode-hdf5-viewer
mechatroner.rainbow-csv
mhutchie.git-graph
mongodb.mongodb-vscode
morningfrog.urdf-visualizer
moyu.snapcode
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-ceintl.vscode-language-pack-zh-hant
ms-dotnettools.csdevkit
ms-dotnettools.csharp
ms-dotnettools.vscode-dotnet-runtime
ms-python.black-formatter
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.azure-repos
ms-vscode.cmake-tools
ms-vscode.cpp-devtools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.hexeditor
ms-vscode.makefile-tools
ms-vscode.remote-explorer
ms-vscode.remote-repositories
ms-vscode.remote-server
ms-vscode.vscode-serial-monitor
ms-vsliveshare.vsliveshare
mshr-h.veriloghdl
natizyskunk.sftp
naumovs.color-highlight
njpwerner.autodocstring
openai.chatgpt
percy.vscode-pydata-viewer
peterschmalfeldt.explorer-exclude
pkief.material-icon-theme
pnp.polacode
ptd.vscode-unitymeta
redhat.java
redhat.vscode-xml
redhat.vscode-yaml
ritwickdey.liveserver
sdras.night-owl
shd101wyy.markdown-preview-enhanced
shyykoserhiy.vscode-spotify
simonsiefke.svg-preview
sissel.shopify-liquid
smilerobotics.urdf
streetsidesoftware.code-spell-checker
tabnine.tabnine-vscode
teros-technology.teroshdl
timonwong.shellcheck
tomoki1207.pdf
twxs.cmake
usernamehw.errorlens
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
vscode-icons-team.vscode-icons
vscodevim.vim
wallabyjs.console-ninja
wayou.vscode-todo-highlight
wholroyd.jinja
xdebug.php-debug
xdebug.php-pack
yzhang.markdown-all-in-one
zhuangtongfa.material-theme
zobo.php-intellisense
